---
kind: property
id: P:Autodesk.Revit.DB.TriangulatedShellComponent.IsClosed
source: html/13b4fda8-4ec3-2a0d-1e31-f1692c08c067.htm
---
# Autodesk.Revit.DB.TriangulatedShellComponent.IsClosed Property

True if and only if the triangulation represents a topologically closed shell
 (i.e., each edge is shared by two triangles).

## Syntax (C#)
```csharp
public bool IsClosed { get; }
```